<template>
    <div class="ppc">
        <section class="ppc__inner create-bg">
            <div class="container-min">
                <div class="ppc__main">
                    <div class="ppc__main--item">
                        <div class="text-padding">
                            <h1>Настройка аккаунта Google Ads</h1>
                            <!--<p>Fully automated advertising tool to help you create and optimize your Google Ads.</p>-->
                            <div class="btn-box">
                                <div class="border-btn-box pointer-large">
                                    <div class="border-btn-inner">
                                        <button @click="showModal" data-text="Заказать" class="border-btn modal-show">Заказать</button>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div class="ppc__main--item hidden">
                        <img src="dist/img/ppc/header-create.jpg" alt="">
                    </div>
                </div>
            </div>
        </section>
        <section class="services">
            <div class="container-min">
                <div class="services__header">
                    <h2>What can you do with your ads?</h2>
                </div>
                <div class="services__block">
                    <div class="services__item">
                        <img src="dist/img/ppc/icon-create-campaign.svg" alt="">
                        <div class="services__text">
                            <h4>Create Ads</h4>
                            <p>Получить профессиональную рекламу всего за несколько кликов</p>
                        </div>
                    </div>
                    <div class="services__item">
                        <img src="dist/img/ppc/icon-create-target.svg" alt="">
                        <div class="services__text">
                            <h4>Target People</h4>
                            <p>Connect your store and turn your products into high-quality ads.</p>
                        </div>
                    </div>
                    <div class="services__item">
                        <img src="dist/img/ppc/icon-create-budget.svg" alt="">
                        <div class="services__text">
                            <h4>Set Budget</h4>
                            <p>Automate your advertising to reach success with less effort.</p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="description">
            <div class="container-min">
                <h2>Первичная настройка аккаунта Google AdWords</h2>
                <div class="text">
                    <p>Подробнее по каждому пункту:</p>
                    <h3>1. Определение целей рекламной кампании.</h3>
                    <p>Первое, что необходимо&nbsp;сделать перед запуском рекламных кампаний в AdWords — это четко определить их цели. Или другими словами четко ответить себе на вопрос: «Для чего создается рекламная кампания? Каких результатов она должна достичь?»</p>
                    <p>Целями рекламы в AdWords могут быть:</p>
                    <ul>
                        <li>Повышение узнаваемости бренда</li>
                        <li>Увеличение объема продаж и привлечение клиентов</li>
                    </ul>
                </div>
                <div class="text">
                    <h3>2. Подбор ключевых слов.</h3>
                    <p>Ключевые слова — одна из самых главных настроек в AdWords, это слова и фразы, по которым будут показываться ваши объявления в ответ на поисковые запросы пользователей.</p>
                    <p>Первичный список ключевых слов всегда можно составить исходя из просто перечисления своих товаров или услуг. Для того, чтобы расширить его, необходимо воспользоваться, который находится в инструментамх аккаунта Google AdWords.</p>
                    <p>Важно знать:</p>
                    <ul style="list-style-type: circle;">
                        <li>Ключевые слова не должны повоторяться как в разных группах объвлений, так и в разных кампаниях;</li>
                        <li>В&nbsp;одной группе объявлений рекомендуется добавлять не более 10 - 20 ключевых слов;</li>
                        <li>В&nbsp;ключевых словах лучше использовать фразы состоящие в основном из 2-3 слов;</li>
                        <li>Важно на этапе подбора ключевых слов также и составить список минус-слов.</li>
                    </ul>
                </div>
                <div class="text">
                    <h3>3. Создание аккаунта AdWords и настройка Кампаний.</h3>
                    <p>Прежде чем создать первую рекламную кампанию, необходимо создать аккаунт AdWords. Во время создания аккаунта AdWords указываются страна, часовой пояс и валюта в которой будет пополняться аккаунт.</p>
                    <p>Создание кампании предполагает:</p>
                    <ul>
                        <li><strong>Выбор типа кампании.</strong> Можно выбрать из вариантов: Поисковая и контекстно-медийная сеть, Только поискова сеть, Только контекстно-медийная сеть и Google Покупки (в этой кампании создаются товарные объявления из Google Merchant Center).</li>
                        <li><strong>Сети.</strong> Есть две сети: 1) <em>Поисковая сеть</em>, в которую входит сам поиск Google, его партнеры, а также некоторые службы google (Картинки, Карты, Покупки и т.д.). 2) <em>Контекстно-медийная сеть</em>, которая охватывает миллионы сайтов партнеров google, а также некоторые собственные проекты google (такие, как Gmail, YouTube, Blogger и т.д.). Выбор сети при настройке кампании зависит от целей рекламной кампании.</li>
                        <li><strong>Устройства.</strong> По умолчанию ваша реклама Google Adwords будет показываться на всех устройствах (Компьютеры, Планшетные ПК и Мобильные устройства с полнофункциональными браузерами). Однако у вас будет возможность установить ставки для различных типов устройств.</li>
                        <li><strong>Местоположения.</strong> В этой настройке задается геотаргетинг рекламной кампании.</li>
                        <li><strong>Языки.</strong> В этой настройке устанавливается язык сайтов, на которых будет показываться реклама.</li>
                        <li><strong>Ставки и бюджет.</strong> В зависимости от того, хотите ли вы назначать ставки вручную или автоматизировать процесс, платить за клики или за тысячу показов, здесь необходимо выбрать соответствующий тип назначения ставок. Бюджет целиком зависит от того сколько вы готовы тратить на рекламную кампанию, в любой момент вы можете изменить бюджет кампании.</li>
                    </ul>
                    <p>В каждом конкретном случае правильный выбор этих настроек также<em> зависит от целей и задач</em>, которые ставятся перед рекламной кампанией.</p>
                </div>
                <div class="text">
                    <h3>4. Организация эффективной структуры аккаунта AdWords.</h3>
                    <p>Чтобы по максимуму использовать рекламный потенциал AdWords, необходимо хорошо организовать структуру аккаунта.</p>
                    <p><strong>Структура аккаунта</strong> — это распределение ключевых слов и объявлений по группам объявлений в зависимости от:</p>
                    <ul>
                        <li>Тематики товара</li>
                        <li>Вида рекламируемого товара</li>
                    </ul>
                    <p>Например, все ключевые слова относящиеся к рубашкам необходимо поместить в одну группу объявлений, а к обуви — в другую.</p>
                    <p><strong>Аккаунт AdWords состоит из четырех основных уровней:</strong></p>
                    <ul>
                        <li>Кампании</li>
                        <li>Группы объявлений</li>
                        <li>Объявлений</li>
                        <li>Ключевые слова</li>
                    </ul>
                    <p>Ключевые слова и объявления входят в <em><strong>группу объявлений</strong></em>, а группы объявлений входят в <strong><em>кампании</em></strong>.</p>
                    <p>Все ключевые слова в группе объявлений должны относиться к одному товару или быть связаны одной тематикой. Тексты объявлений в рамках одной группы объявлений должны быть релевантными любому ключевому слову из этой группы объявлений.</p>
                    <p>Кампании можно из организовывать исходя из:</p>
                    <ul>
                        <li>Целей рекламных кампаний</li>
                        <li>Видов рекламируемых товаров и услуг</li>
                        <li>Региона, в котором рекламируются товары и услуги</li>
                    </ul>
                    <p>Для примера, в аккаунте могут быть такие кампании: "Обувь_Киев" и "Обувь_Харьков". В каждой из этих кампаний могут быть группы объявлений: "Ботинки", "Туфли", "Сапоги", "Сандали" и т.д. В данном примере кампания организована по двум признакам: виду товара и региону.</p>
                </div>
                <div class="text">
                    <h3>5. Составление текстов объявлений</h3>
                    <p>В большинстве случаев цель объявления — заставить пользователя перейти на ваш сайт. Это возможно, если на фоне объявлений конкурентов ваше будет более заметным и более убедительным. Чтобы потенциальные клиенты кликали именно по вашему объявлению необходимо:</p>
                    <ul>
                        <li><strong>Использовать ключевые слова в тексте объявлений</strong>.&nbsp;Таким образом повышается релевантность объявления, что хорошо влияет на показатель качества, что, в свою очередь, <em>улучшает позиции объявлений</em> и <em>снижает стоимость клика</em>. Также когда клиент вводит запрос соответствующий ключевому запросу то само слово подсвечивается жирным.</li>
                        <li><strong>Указывать в объявлениях свои преимущества.</strong> Это так называемая «завлекаловка», которой могут&nbsp;быть бесплатная или быстрая доставка, сезонные скидки, низкая стоимость и т. д.</li>
                        <li><strong>Использовать призыв к действию</strong> в тексте объявления.&nbsp;Подскажите, что должен сделать клиент. Например: «Заказывайте сейчас», «Покупайте», «Купите у нас», «Регистрируйтесь», «Узнайте» и т. д. &nbsp;</li>
                        <li><strong>Составить несколько текстов объявлений. </strong>Добавить в группу объявлений не один, а несколько текстов объявлений, отличающихся друг от друга, чтобы впоследствии, определить, какие тексты лучше работают.</li>
                    </ul>
                </div>
                <div class="text">
                    <h3>6. Создание расширений объявлений Google AdWords</h3>
                    <p>Расширения для объявлений позволяют включить в объявления еще больше информации о ваших товарах и услугах. Они позитивно влияют на качество объявления, правильно приготовленные расширения могут позитивно повлиять на показатель качества и как следствие уменьшить стоимость клика. Расширение объявления также помогает увеличить CTR, а также увеличивает общую площать объявления и делает его более заметным на фоне конкурентов.</p>
                    <p>В настройках аккаунта адвордс предоставлены такие дополнительные расширения:</p>
                    <ul>
                        <li>Местоположение</li>
                        <li>Дополнительные ссылки</li>
                        <li>Позвонить</li>
                        <li>Динамические поисковые объявления</li>
                        <li>Мобильные приложения</li>
                        <li>Отзывы</li>
                    </ul>
                </div>
                <div class="text">
                    <h3>7. Связь аккаунтов Google AdWords и Google Analytics</h3>
                    <p>Очень важно отслеживать качество трафика с контекстной рекламы, поэтому нужно обязательно связать аккаунт AdWords&nbsp;с аккаунтом Google Ananlytics. Для этого нужно в Google Ananlytics перейти в раздел&nbsp;«Администратор», дальше в столбце «Аккаунт»&nbsp;перейдите на «Связать с AdWords»&nbsp;и последнее —&nbsp;«+ Добавить аккаунт».</p>
                    <p>Для того, чтобы Google Analytics мог отличить трафик из контекстной рекламы от поискового трафика с органической выдачи, необходимо все ссылки с контекстной рекламы пометить специальными параметрами. Это можно сделать либо с помощью UTM-меток либо с помощью «Автоматической пометки тегами».&nbsp;Для этого в аккаунте AdWords, в правом верхнем углу необходимо перейти в дополнительные настройки (значок шестеренки)&nbsp;и в&nbsp;«Настройках аккаунта»&nbsp;в пункте&nbsp;«Отслеживание.&nbsp;Автоматическая пометка тегами» вместо «нет, спасибо»&nbsp;поставить&nbsp;«да».</p>
                </div>
                <div class="text">
                    <p><strong>Стоимость работ по первичной настройке&nbsp;Google AdWords&nbsp;от 200$.</strong></p>
                </div>
                <div class="btn-box">
                    <div class="border-btn-box pointer-large">
                        <div class="border-btn-inner">
                            <button @click="showModal" data-text="Заказать" class="border-btn modal-show">Заказать</button>
                        </div>
                    </div>
                </div>
            </div>
        </section>

        <back-to-top bottom="50px" right="50px" visibleoffset="700">
            <img class="btn-to-top" src="dist/img/topBtn.png" alt="">
        </back-to-top>
        <modal></modal>
        <Footer></Footer>
    </div>
</template>

<script>
    import Navbar from '../components/Navbar.vue'
    import Modal from '../components/Modal.vue'

    import Footer from '../components/Footer'
    import BackToTop from 'vue-backtotop'
    export default {
        name: 'create',
        components: {
            Navbar,
            Footer,
            Modal,
            BackToTop
        },
        methods: {
            showModal() {
                document.querySelector('.modal-wrap').classList.remove('hide');
            },
            closeModal() {
                document.querySelectorAll('.modal-wrap').forEach(function (element) {
                    element.classList.add('hide');
                });
            },
        },
    };
</script>